Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/legislative/legislative_background_for_accessing_environmental_information.html.txt.tmx
Source language: en
Languages: ga

source: Legislative background for accessing environmental information
ga: Cúlra reachtach: Rochtain ar fhaisnéis comhshaoil

source: To access environmental information you can use Freedom of Information legislation or the European Communities (Access to Information on the Environment) Regulations 2007 to 2014
ga: Chun faisnéis comhshaoil a fháil, is féidir leat úsáid a bhaint as an reachtaíocht maidir le Saoráil Faisnéise nó as Rialacháin na gComhphobal Eorpach (Rochtain ar Fhaisnéis maidir leis an gComhshaol) 2007 go 2011

source: An unofficial consolidation of these Regulations (SI 133 of 2007, SI 662 of 2011 and SI 615 of 2014 (pdf)) is available here (pdf)
ga: Tá comhdhlúthú neamhoifigiúil de na Rialacháin seo (IR 133/2007, IR 662/2011 agus IR 615/2014 (pdf)) le fáil anseo (pdf)

source: These Regulations give effect to Directive 2003/4/EC on Public Access to Information on Environmental Matters, which provides that individuals have the right to access environmental information held by public authorities
ga: Tugann na Rialacháin seo feidhm don Treoir maidir le Rochtain Phoiblí ar Fhaisnéis faoi Chúrsaí Comhshaoil, Treoir 2003/4/CE, a fhorálann go bhfuil ceart rochtana ag daoine aonair maidir le faisnéis faoin gcomhshaol arna coinneáil ag údaráis phoiblí

source: This is the first of 2 Directives to implement the Aarhus Convention (UNECE Convention on Access to Information, Public Participation in Decision-Making and Access to Justice in Environmental Matters 1998)
ga: Tá an Treoir seo ar an gcéad cheann de dhá Threoir chun Coinbhinsiún Aarhus (Coinbhinsiún UNECE maidir le Rochtain ar Fhaisnéis, Rannpháirteachas an Phobail le linn Cinntí a Dhéanamh agus Rochtain ar Cheartas i gCúrsaí Comhshaoil 1998) a chur i bhfeidhm

source: Ireland ratified the Aarhus Convention on 20 June 2012
ga: Dhaingnigh Éire Coinbhinsiún Aarhus ar 20 Meitheamh 2012

source: The Aarhus Convention lays down a set of basic rules to promote citizens' involvement in environmental matters and improve enforcement of environmental law
ga: Leagann Coinbhinsiún Aarhus síos sraith rialacha bunúsacha chun rannpháirtíocht na saoránach a spreagadh i gcúrsaí comhshaoil agus forghníomhú dlí na timpeallachta a fheabhsú

source: It allows the public to have access to environmental information, provides for participation in environmental decision-making, and allows the public to seek redress when environmental law is infringed
ga: Tugann sé rochtain don phobal ar fhaisnéis comhshaoil, déanann sé foráil do rannpháirtíocht i gcinntí comhshaoil, agus tugann sé deis don phobal sásamh a lorg nuair a sháraítear dlí na timpeallachta

source: The EU approved the Aarhus Convention in 2005 (Council Decision 2005/370/EC of 17 February 2005)
ga: Cheadaigh an tAE Coinbhinsiún Aarhus in 2005 (Cinneadh 2005/370/CE ón gComhairle an 17 Feabhra 2005)

source: The second Directive implementing the Aarhus Convention is Directive 2003/35/EC on Public Participation in respect of the Drawing up of Certain Plans and Programes relating to the Environment
ga: Is í an dara Treoir a chuireann Coinbhinsiún Aarhus i bhfeidhm ná Treoir 2003/35/CE maidir le Rannpháirtíocht Phoiblí i leith Pleananna agus Cláir Áirithe a bhaineann leis an gComhshaol a Tharraingt Suas

source: This deals with public participation in decision-making
ga: Baineann sí seo le rannpháirtíocht phoiblí i ndéanamh cinntí

source: It provides that member states must ensure that mechanisms exist to facilitate public participation in decisions about the environment
ga: Foráiltear inti go gcaithfidh ballstáit a chinntiú go bhfuil meicníochtaí i bhfeidhm chun rannpháirtíocht an phobail i gcinntí comhshaoil a éascú

source: Under the provisions of this Directive, members of the public are entitled to appeal relevant decisions of public bodies by way of judicial review
ga: Faoi fhorálacha na Treorach seo, tá baill den phobal i dteideal achomharc a dhéanamh i gcoinne cinntí ábhartha de chuid chomhlachtaí poiblí trí athbhreithniú breithiúnach
